tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "jesseduffield/lazygit"
tap "nats-io/nats-tools"
tap "potatolabs/git-redate"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Assuan IPC Library
brew "libassuan"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Password manager
brew "pass"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# Extraction utility for .zip compressed archives
brew "unzip"
# Internet file retriever
brew "wget"
# General-purpose data compression with high compression ratio
brew "xz"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# NATS utility
brew "nats-io/nats-tools/nats"
# Change the dates of several git commits with a single command
brew "potatolabs/git-redate/git-redate"
# AI-powered productivity tool for the command-line
cask "amazon-q"
# Memory training application
cask "anki"
# App for managing battery charging
cask "batfi"
# Screen capturing tool
cask "cleanshot"
# Block websites, games and applications
cask "cold-turkey-blocker"
# Track and budget money
cask "copilot"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Web browser
cask "firefox"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# Menu bar manager
cask "jordanbaird-ice"
# Keyboard customiser
cask "karabiner-elements"
# Discover, download, and run local LLMs
cask "lm-studio"
# Software for Logitech devices
cask "logi-options+"
# Support for Logitech G gear
cask "logitech-g-hub"
# Adaptive brightness for external displays
cask "lunar"
# Silence embarrassing notifications while screensharing
cask "muzzle"
# Free and open-source RSS reader
cask "netnewswire"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "iMovie", id: 408981434
mas "Kindle", id: 302584613
mas "Klack", id: 6446206067
mas "Slack", id: 803453959
mas "Things", id: 904280696
mas "Xcode", id: 497799835
vscode "alexcvzz.vscode-sqlite"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "andenetalexander.vim-cheatsheet"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.path-intellisense"
vscode "csstools.postcss"
vscode "dan-c-underwood.arm"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "drcika.apc-extension"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "heybourn.headwind"
vscode "janisdd.vscode-edit-csv"
vscode "jock.svg"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-powertoys"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "patbenatar.advanced-new-file"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "rvest.vs-code-prettier-eslint"
vscode "tomoki1207.pdf"
vscode "tonybaloney.vscode-pets"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vintharas.learn-vim"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "wallabyjs.console-ninja"
vscode "xabikos.javascriptsnippets"
