tap "buo/cask-upgrade"
tap "gromgit/fuse"
tap "homebrew/bundle"
tap "jesseduffield/lazygit"
tap "nats-io/nats-tools"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "potatolabs/git-redate"
tap "qmk/qmk"
# General-purpose data compression with high compression ratio
brew "xz"
# Distributed revision control system
brew "git"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Load/unload environment variables based on $PWD
brew "direnv"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Assuan IPC Library
brew "libassuan"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# International domain name library
brew "libidn"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Password manager
brew "pass"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Non-interactive SSH password auth
brew "sshpass"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli"
# Extraction utility for .zip compressed archives
brew "unzip"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# NATS utility
brew "nats-io/nats-tools/nats"
# Change the dates of several git commits with a single command
brew "potatolabs/git-redate/git-redate"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# AI-powered productivity tool for the command-line
cask "amazon-q"
# Memory training application
cask "anki"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# App for managing battery charging
cask "batfi"
# Web browser focusing on privacy
cask "brave-browser"
# Screen capturing tool
cask "cleanshot"
# Block websites, games and applications
cask "cold-turkey-blocker"
# Track and budget money
cask "copilot"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Web browser
cask "firefox"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# Menu bar manager
cask "jordanbaird-ice"
# Keyboard customiser
cask "karabiner-elements"
# Open-source keystroke visualiser
cask "keycastr"
# Discover, download, and run local LLMs
cask "lm-studio"
# Software for Logitech devices
cask "logi-options+"
# Optimise your webcam, headset, and Logi Dock for video meetings
cask "logitune"
# Adaptive brightness for external displays
cask "lunar"
# File system integration
cask "macfuse"
# Speech recognition tool
cask "macwhisper"
# Free and open-source RSS reader
cask "netnewswire"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# App icon replacement utility
cask "replacicon"
# Screen recorder and editor
cask "screen-studio"
# Tool for sending personal documents to Kindles from Macs
cask "send-to-kindle"
# Team communication and collaboration software
cask "slack"
# Video game digital distribution service
cask "steam"
# Native GUI tool for relational databases
cask "tableplus"
# Calling and messaging application focusing on security
cask "viber"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.java"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
